{"backend": "tensorflow", "keras_version": "2.1.4", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "data_format": "channels_last", "dtype": "float32", "trainable": true, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "activation": "relu", "filters": 64, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "strides": [3, 3], "trainable": true, "pool_size": [3, 3], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "data_format": "channels_last", "trainable": true, "kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "activation": "relu", "filters": 32, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "data_format": "channels_last", "strides": [3, 3], "trainable": true, "pool_size": [3, 3], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "activation": "relu", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "units": 4096, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.5, "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "activation": "softmax", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null}}]}